[
  {
    "text": "Brain: smooth\n\nTits: jacked\n\nHands: diamond\n\nErection: 2 inches\n\n🚀🚀🚀LETS GO🚀🚀🚀",
    "sentiment": "positive"
  },
  {
    "text": "#IM NOT FUCKING LEAVING",
    "sentiment": "positive"
  },
  {
    "text": "These boomer fucks on CNBC are so freaking angry that they can't manipulate the market anymore like they used to be able to in 'the good old days'. They are literally foaming at the mouth that GME should be at $2. And they're blaming everything on WSB. One of the fund managers even tried to imply that maybe there are foreign powers involved here. Like yeah ok you old boomer fuck, if North Korea or Iran wanted to hurt America, they'd start buying fucking GameStop shares, because that'd show us. Jesus motherfucking Christ."
    "sentiment": "negative"
  },
  {
    "text": "Bought in at 150 and going to hold. The greatest pressure creates the brightest 💎\n\nEdit: Remember me when you stare out into the shining cosmos from whatever galaxy you land in at the end of your journeys 🚀\n\nEdit 2 - 6:52pm: Bought $2,000 more. Still holding. Wanted to make some gains to finally buy an apartment for my girlfriend and I. She might leave me but at least I’ll have balls of steel and 💎👐🏻\n\nEdit 3 - 7:58pm: All your comments are nice and positive. Stay strong out there and hold until your hands start to shine 💪🏻💎👐🏻 I’m in deep and so are a lot of others. We are with you and we will only be able to do this together."
    "sentiment": "positive"
  },
  {
    "text": "It's weird that everyone is selling off. The DD's over the last week have all made it absolutely clear that this was going to happen right before the big run up to the moon.  \n\n\nThis squeeze is going to be larger than the volks squeeze in 2008. They dipped 80% right before the squeeze. How the fuck are people really in here getting scared right now? It's the same exact chart damn near lmao. God damn morons.  \n\n\nNot that I care, WSB doesn't hold enough shares to move the price $3 much less $80. This isn't WSB paper hands doing this, this is just how it works. So sell off for a loss and get the fuck off the thread if you're going to actually be a retard."
    "sentiment": "negative"
  },
  {
    "text": "If you're feeling miserable, DFV's net worth went up like $11,000,000 today and then came right back down. Thats 2 commas. Dude is probably still in sunglasses drinking beer going 'WOOO SIIIICK'. \n\n  \nIf that man can be chill, so can you. Hold those fucking shares."
    "sentiment": "positive"
  },
  {
    "text": "there is no dump. GME isn't rising on a pump and dump, it's rising on a short squeeze and a gamma squeeze. hedge funds who shorted GME are the unironic version of 'price hits x and the shotgun goes off' meme on a massive scale right now.\n\nfirst there is the market makers, who sell call options. every single call option on GME expired in the money last week, which meant market makers had to buy a huge amount of shares to cover the calls they sold. they issued new options today and when gamestop crossed 115 every new option was already in the money because 115 was the highest strike based on 2x last closing. but that's just a small part of the squeeze.\n\nthe big squeeze is the hedge funds that are short game stop. right now they're literally being held hostage by gamestop shareholders. some of them have probably already been effectively blown up. melvin capital has a big short position and only has $7 billion assets under management.\n\nthere's not going to be anything like a 'GME bagholder' right now current holders have the hedge funds, their parent companies, and then eventually the investment banks which act as prime brokers for those companies under hostage. they decide the price they have to pay to get out from the squeeze.\n\ntheoretically gamestop could reach a $1 trillion market cap end of week if shareholders refuse to sell. small funds which had a short position like melvin are probably already effectively blown up if they didn't close out their short position, their liability will pass on to their parent company. if the parent company blows up now their bank has a problem. if GME holders refuse to sell, the bank could theoretically get liquidated as well. i don't even know what happens after that. it's an unprecedented event.\n\n- anon 4channer"
    "sentiment": "neutral"
  },
  {
    "text": "Fellow retards...\n\nWe make retard jokes here a lot. It’s all banter I know. But when the money drops, can I implore you to spend some of your winnings and do some good and donate to an autism charity?\n\nhttps://researchautism.org\n\nThank you autists."
    "sentiment": "positive"
  }
]
